---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ColumnFailures.ColumnTopBelowBaseFailure
source: html/923e94e6-364d-28e1-d80d-7fb2d22f2ab8.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ColumnFailures.ColumnTopBelowBaseFailure Property

The column top can't be moved below its base.

## Syntax (C#)
```csharp
public static FailureDefinitionId ColumnTopBelowBaseFailure { get; }
```